Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གསུམ་གང་ཞེ་ན། རྟོག་པ་དང་བཅས་ཤིང་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་ཅིང་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ། །དེ་ལ་རྟོག་པ་དང་བཅས་ཤིང་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན།
en: If you ask what these three are, they comprise (1) the meditative stability endowed with ideation and scrutiny, (2) the meditative stability free from ideation and endowed merely with scrutiny, and (3) the meditative stability devoid of both ideation and scrutiny.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན།
en: In this regard, Subhūti, if you ask what is the meditative stability endowed with ideation and scrutiny, bodhisattva great beings achieve and maintain the first meditative concentration where there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from freedom.

source: བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཤིང་གནས་པ་འདི་ནི།
en: This is the meditative stability endowed with ideation and scrutiny.

source: རྟོག་པ་དང་བཅས་ཤིང་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་ཏོ། །དེ་ལ་རྟོག་པ་མེད་པ་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། བསམ་གཏན་དང་པོ་དང་། བསམ་གཏན་གཉིས་པའི་བར་ཏེ།
en: If you ask what is the meditative stability free from ideation and endowed merely with scrutiny, it denotes the state between the first meditative concentration and the second meditative concentration.

source: འདི་ནི་རྟོག་པ་མྱེད་པ་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: This is called the meditative stability free from ideation and endowed merely with scrutiny. {

source: །དེ་ལ་རྟོག་པ་མྱེད་ཅིང་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་།
en: Dt.210} If you ask what is the meditative stability devoid of both ideation and scrutiny, it includes the second, third, and fourth meditative concentrations, along with the meditative absorptions of the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, the sphere of neither perception nor nonperception, and the cessation of perceptions and feelings.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་སྟེ།
en: This is called the meditative stability devoid of both ideation and scrutiny. [

source: འདི་ནི་མི་རྟོག་མི་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །རབ་འབྱོར་འདི་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Cultivated] without apprehending anything, this indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་རྗེས་སུ་དྲན་པ་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the ten recollections.

source: ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་རྗེས་སུ་དྲན་པ་དང་། སྐྱེ་བ་རྗེས་སུ་དྲན་པ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་དང་། ལུས་ཀྱི་རྣམ་པ་རྗེས་སུ་དྲན་པ་སྟེ།
en: If you ask what these ten are, they comprise (1) the recollection of the Buddha, (2) recollection of the Dharma, (3) recollection of the Saṅgha, (4) recollection of ethical discipline, (5) recollection of giving away, (6) recollection of the god realms, (7) recollection of disillusionment [with cyclic existence], (8) recollection of breathing, (9) recollection of death, and (10) recollection of the body. [

source: རབ་འབྱོར་འདི་ཡང་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟ་སྟེ།
en: Cultivated] without apprehending anything, this indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, and the nine serial steps of meditative absorption. “

source: དེ་ལ་བསམ་གཏན་བཞི་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པ།
en: If you ask what are the four meditative concentrations, in this regard, when bodhisattva great beings practice the perfection of wisdom, (1) they achieve and maintain the first meditative concentration where there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from freedom. (

source: དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་དཔྱོད་པ་ཉེ་བར་ཞི་ནས། ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས། རྟོག་པ་མེད་པ།
en: 2) They achieve and maintain the second meditative concentration where ideation and scrutiny have been stilled, and there is an intense inner clarity—the absence of ideation and scrutiny being due to one-pointed mental focus—while the joy and bliss that arise from meditative stability are present. (

source: དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན། བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་དགའ་བ་ལས་འདོད་ཆགས་དང་བྲལ་བས་དྲན་པ་དང་ལྡན་ཞིང་། ཤེས་བཞིན་དུ་བཏང་སྙོམས་ལ་གནས་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: 3) They achieve and maintain the third meditative concentration where joy is absent, abiding in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present and bliss is experienced by the body.

source: འཕགས་པ་རྣམས་ཀྱིས་དེ་ལ་དྲན་པ་དང་ལྡན་པ། བདེ་བ་ལ་རྣམ་པར་སྤྱོད་པ། བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ།
en: This is what sublime beings describe as ‘mindful, abiding in bliss, and equanimous.’ (

source: དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་བདེ་བ་ཡང་སྤངས་སྡུག་བསྔལ་བ་ཡང་སྤངས་ཤིང་།
en: 4) They achieve and maintain the fourth meditative concentration where even that sense of bliss is abandoned and former states of suffering have also been eliminated.

source: ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་སྔ་ནས་ཀྱང་ནུབ་པས། བདེ་བ་ཡང་མེད་སྡུག་བསྔལ་བ་ཡང་མེད་པ། བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པའི་བསམ་གཏན་བཞི་བ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཉེ་བར་བསྒྲུབས་ཤིང་གནས་ཏེ།
en: Here, neither suffering nor bliss is present because blissful and unhappy states of mind have both subsided, while equanimity and mindfulness are utterly pure.

source: དེ་དག་ནི་བསམ་གཏན་བཞི་པའོ།
en: These are the four meditative concentrations. “

source: །དེ་ལ་ཚད་མེད་པ་བཞི་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱམས་པ་དང་ལྡན་པའི་སེམས་རྒྱ་ཆེན་པོ་ཤིན་དུ་ཡངས་པ། མི་གཉིས་པ། ཚད་མེད་པ། གཅུགས་མེད་པ། གནོད་པ་མེད་པ། ལྟོད་པ་མེད་པ། ཡོངས་སུ་རྫོགས་པ། ཤིན་དུ་བསྒོམས་པས། འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ།
en: If you ask what are the four immeasurable attitudes, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they maintain, without apprehending anything, a state of mind imbued with (1) loving kindness that is vast, most extensive, nondual, immeasurable, free from enmity, free from harm, without rivalry, perfected, and well cultivated, so that it is considered to permeate extensively the ten directions encompassed by the limits of space, beyond the mundane sphere.

source: ནམ་མཁའི་མཐས་གཏུགས་པའི་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ་མོས་པར་བྱས་ཤིང་། མི་དམྱིགས་པའི་ཚུལ་གྱིས་རྣམ་པར་སྤྱོད་དོ། །སྙིང་རྗེ་དང་ལྡན་པ་དང་། དགའ་བ་དང་ལྡན་པ་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་རྒྱ་ཆེན་པོ་ཤིན་དུ་ཡངས་པ། མི་གཉིས་པ། ཚད་མེད་པ། གཅུགས་མེད་པ། གནོད་པ་མེད་པ། ལྟོད་པ་མེད་པ་ཡོངས་སུ་རྫོགས་པ། ཤིན་དུ་བསྒོམས་པས། འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པའི་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ།
en: They maintain, without apprehending anything, a state of mind imbued with (2) compassion, (3) empathetic joy, and (4) equanimity that is vast, most extensive, nondual, immeasurable, free from enmity, free from harm, without rivalry, perfected, and well cultivated, so that these are considered to permeate extensively the ten directions encompassed by the limits of space, beyond the mundane sphere.

source: མོས་པར་བྱས་ཤིང་། མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པར་སྤྱོད་དེ། དེ་དག་ནི་ཚད་མེད་པ་བཞིའོ།
en: These are the four immeasurable attitudes. “

source: །དེ་ལ་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་ཡིད་ལ་མི་བྱེད་པས།
en: If you ask what are the four formless meditative absorptions, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, (1) [the first ensues] once the perceptions of physical forms have been completely transcended in all respects, when the perceptions of obstructed phenomena have subsided, and the mind does not engage with diverse perceptions, so that one achieves and dwells in the sphere of infinite space, thinking, ‘Space is infinite.’ (

source: ནམ་མཁའ་མཐའ་ཡས་སོ་ཞེས་ཏེ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་ཞེས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: 2) [The second ensues] once the sphere of infinite space has been completely transcended in all respects, and one achieves and dwells in the sphere of infinite consciousness, thinking, ‘Consciousness is infinite.’ (

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། ཅུང་ཟད་མ་ཡོད་དོ་ཞེས་ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: 3) [The third ensues] once the sphere of infinite consciousness has been completely transcended in all respects, and one achieves and dwells in the sphere of nothing-at-all, thinking, ‘There is nothing at all.’ (

source: །དེ་དག་ནི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞིའོ།
en: These are the four formless meditative absorptions. “

source: །དེ་ལ་རྣམ་པར་ཐར་པ་བརྒྱད་གང་ཞེ་ན། གཟུགས་ཅན་གྱིས་གཟུགས་རྣམས་མཐོང་བ་འདི་ནི་རྣམ་པར་ཐར་བ་དང་པོའོ།
en: If you ask what are the eight aspects of liberation, they are as follows: (1) The first aspect of liberation ensues when corporeal beings observe physical forms [in order to compose the mind]. (

source: །ནང་གཟུགས་མེད་པའི་འདུ་ཤེས་དང་ལྡན་པས། ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་མཐོང་བ་འདི་ནི། རྣམ་པར་ཐར་པ་གཉིས་པའོ།
en: 2) The second aspect of liberation ensues when formless beings endowed with internal perception observe external physical forms. (

source: །བཟང་བར་མོས་པ་འདི་ནི་རྣམ་པར་ཐར་བ་གསུམ་པའོ།
en: 3) The third aspect of liberation ensues when beings are inclined toward pleasant states. (

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་བར་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: 8) [The eighth aspect of liberation ensues] when the sphere of neither perception nor nonperception has been completely transcended in all respects, and one achieves and dwells in the cessation of all perceptions and feelings, without apprehending anything.

source: །དེ་དག་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་དོ།
en: These are the eight aspects of liberation. “

source: །དེ་ལ་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ།
en: If you ask what are the nine serial steps of meditative absorption, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, (1) [the first step ensues] when one achieves and maintains the first meditative concentration, that is to say, when there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from freedom. (

source: དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་སྤྱོད་པ་ཉེ་བར་ཞི་ནས། ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས། རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ།
en: 2) [The second step ensues] when one achieves and maintains the second meditative concentration, that is to say, when there is an intense inner clarity, devoid of both ideation and scrutiny—the absence of ideation and scrutiny being due to one-pointed mental focus—while the joy and bliss that arise from meditative stability are present. (

source: ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན། བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་དགའ་བ་ལས་འདོད་ཆགས་དང་བྲལ་བ་དང་། དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་བཏང་སྙོམས་སུ་གནས་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: 3) [The third step ensues] when one achieves and maintains the third meditative concentration free from joy, that is to say, when one dwells in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present, and bliss is still experienced by the body.

source: འཕགས་པ་རྣམས་ཀྱིས་དེ་ལ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་རྣམ་པར་སྤྱོད་པ། བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ།
en: This is what sublime beings describe as ‘mindful, abiding in bliss, and equanimous.’ (

source: དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་བདེ་བ་ཡང་སྤངས། སྡུག་བསྔལ་བ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་།
en: 4) [The fourth step ensues] when one achieves and maintains the fourth meditative concentration, that is to say, when even that sense of bliss is abandoned and former states of suffering have also been eliminated.

source: ཡིད་མི་བདེ་བ་སྔ་ནས་ཀྱང་ནུབ་པས། བདེ་བ་ཡང་མེད། སྡུག་བསྔལ་བ་ཡང་མེད་པ། བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པ། བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Here, neither suffering nor bliss is present because blissful and unhappy states of mind have both subsided, while equanimity and mindfulness are utterly pure. (

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་ཞེས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: 6) [The sixth step ensues] when the sphere of infinite space has been completely transcended in all respects, and one achieves and dwells in the sphere of infinite consciousness, thinking, ‘Consciousness is infinite.’ (

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་། ཚོར་བ་འགོག་པའི་བར་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཉེ་བར་བསྒྲུབས་ཤིང་གནས་ཏེ།
en: 9) [The ninth step ensues] when the sphere of neither perception nor nonperception has been completely transcended in all respects, and one achieves and dwells in the cessation of all perceptions and feelings, without apprehending anything.

source: དེ་དག་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའོ།
en: These are the nine serial steps of meditative absorption. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གནས་ལ་ཡང་གནས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །གནས་མ་ཡིན་པ་ལ་ཡང་གནས་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་དང་། ལས་ཡོངས་སུ་ལེན་པའི་རྣམ་པར་སྨིན་པ་གནས་ཀྱི་རྣམ་པ་དང་། རྒྱུའི་རྣམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །འཇིག་རྟེན་གྱི་ཁམས་ནི་སྣ་ཚོགས་ཅན་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ནི་དུ་མ་པའོ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །སེམས་ཅན་གཞན་དང་། གང་ཟག་གཞན་གྱི་མོས་པ་སྣ་ཚོགས་དང་། མོས་པ་དུ་མ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །སེམས་ཅན་གཞན་ཡང་། གང་ཟག་གཞན་གྱི་དབང་པོ་རབ་དང་། ཐ་མ་ཤེས་པར་བྱ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཀུན་དུ་འགྲོ་བའི་ལམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་བ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་རྣམ་པར་དགོད་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །དེ་
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings entails the ten powers of the tathāgatas.

source: རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ཏེ། ཚེ་རབས་གཅིག་ཀྱང་རྗེས་སུ་དྲན་པ་ནས། རྣམ་པ་དང་བཅས། ས་མལ་དང་བཅས། གཏན་ཚིགས་དང་བཅས་པའི་བར་དུ། རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ནོ། །དེ་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས་སེམས་ཅན་འཆི་འཕོ་དང་། སྐྱེ་བ་དག་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཟག་པ་ཟད་པའི་ཕྱིར་སེམས་རྣམ་པར་གྲོལ་བ་དང་། ཤེས་རབ་རྣམ་པར་གྲོལ་བ། ཟག་པ་མེད་པ། རང་གི་མངོན་པར་ཤེས་པས་མངོན་པར་བྱས་ཏེ།
en: If you ask what these ten are, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they acquire (1) definitive knowledge that phenomena that are possible are indeed possible, and definitive knowledge that phenomena that are impossible are indeed impossible; (2) definitive knowledge, through possibilities and causes, of the maturation of the past, future, and present actions [of beings], and of those who undertake such actions; (3) definitive knowledge of various realms and their multiple constituents; (4) definitive knowledge of the diversity of inclinations and the multiplicity of inclinations that other beings, other individuals, have; (5) definitive knowledge of whether the acumen of other beings, other individuals, is superior or inferior; (6) definitive knowledge of the paths that lead anywhere; (7) definitive knowledge of all the afflicted and purified mental states and their emergence, with respect to the faculties, powers, branches of enlightenment, meditative concentrations, aspects of liberation, meditative stabilities, and formless absorptions; (8) definitive knowledge of the recollection of multiple past abodes, ranging from the recollection of individual lifetimes to their circumstances, situations, and causes; (9) definitive knowledge through pure clairvoyance, transcending the vision of human beings, of the death, transmigration, and rebirth of beings; and (10) definitive knowledge that through one’s own extrasensory powers one has actualized, achieved, and maintained the liberation of mind and the liberation of wisdom in the state that is free from contaminants because all contaminants have ceased, and so one can say, ‘My rebirths have come to an end.

source: ཉེ་བར་བསྒྲུབས་ཤིང་རྣམ་པར་སྤྱོད་དོ། །བདག་གི་སྐྱེ་བ་ནི་ཟད་དོ།
en: I have practiced celibacy.

source: །བདག་གིས་ཚངས་པར་སྤྱོད་པ་ནི་སྤྱད་དོ། །བྱ་བ་ནི་བྱས་སོ།
en: I have fulfilled my duties.

source: །རྣམ་པ་འདི་ལྟ་བུ་གཞན་ནི་མེད་དོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ།
en: I will experience no other rebirths apart from this one.’ [

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདི་ལྟར་མི་འཇིགས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: Dt.211} “Moreover, Subhūti, the Great Vehicle of bodhisattva great beings entails the four fearlessnesses [proclaimed by the buddhas].

source: བདག་གིས་ཡང་དག་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་དམ་བཅས་ན། དེ་ལ་ཆོས་འདི་རྣམས་མངོན་པར་སངས་མ་རྒྱས་སོ་ཞེས་བྱ་བར་བདག་ལ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། གཞན་སུ་ཡང་རུང་སྟེ། འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: If you ask what these four are, [the buddhas would say]: (1) ‘When I claim to have attained completely awakened buddhahood, if some virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else should say that I have not attained consummate buddhahood with respect to these [particular] phenomena here, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། དེ་ལ་བདག་བདེ་བ་ཐོབ་པ་དང་།
en: By correctly disregarding that reason, I have found ease and dwell in it.

source: བག་ཚ་བ་མེད་པ་ཐོབ་པ་དང་། མི་འཇིགས་པ་ཐོབ་པར་རྣམ་པར་སྤྱོད་དེ།
en: To have attained this absence of trepidation is to have attained fearlessness.

source: ཁྱུ་མཆོག་རླབས་པོ་ཆེའི་གནས་སུ་དམ་བཅའོ།
en: I claim my exalted place as a great leader.

source: །འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་བསྒྲག་གོ །ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན། དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ།
en: I will rightly roar the lion’s roar in the midst of the assembly!

source: བདུད་དམ། ཚངས་པའམ། གཞན་སུས་ཀྱང་རུང་སྟེ། ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ། བདག་གིས་རབ་ཏུ་བསྐོར་བར་བྱའོ། །བདག་ཟག་པ་ཟད་དོ་ཞེས་དམ་བཅས་ན། དེ་ལ་ཟག་པ་འདི་རྣམས་ཡོངས་སུ་ཟད་པར་མ་གྱུར་ཏོ།
en: I will turn the wheel of Brahmā that no one in the world—no virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else—could previously turn in conformity with the Dharma!’ (

source: །ཞེས་བྱ་བར་བདག་ལ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ་གཞན་སུ་ཡང་རུང་སྟེ་འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ། །ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: 2) “ ‘When I claim I am one whose contaminants have ceased, if some virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else should say that these [particular] contaminants of mine have not ceased, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: རྒྱུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། དེ་ལ་བདག་བདེ་བ་ཐོབ་པ་དང་།
en: By correctly disregarding that reason, I have found ease and dwell in it.

source: །འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་བསྒྲག་གོ །
en: I will rightly roar the lion’s roar in the midst of the assembly!

source: ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། གཞན་སུས་ཀྱང་རུང་སྟེ། ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ། བདག་གིས་རབ་ཏུ་བསྐོར་བར་བྱའོ། །གང་ཡང་བདག་གིས་བར་ཆད་ཀྱི་ཆོས་སུ་བསྟན་པ་དེ་དག་ལ་བསྟན་ནས། བར་ཆད་ཀྱི་ཆོས་སུ་མི་འགྱུར་བ་དེ་ལྟ་བུའི་གནས་མེད་དེ། དེའི་ཕྱིར་བདག་ལ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ།
en: I will turn the wheel of Brahmā that no one in the world—no virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else—could previously turn in conformity with the Dharma!’ (

source: ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། གཞན་སུ་ཡང་རུང་སྟེ། འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: 3) “ ‘When I claim to have explained those phenomena that cause obstacles [on the spiritual path], if some virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else should insist in this respect that even though one might depend on those phenomena, there will be no obstacles and that that would be impossible, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། གཞན་སུས་ཀྱང་རུང་སྟེ། ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ། བདག་གིས་རབ་ཏུ་བསྐོར་བར་བྱའོ།
en: I will turn the wheel of Brahmā that no one in the world—no virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else—could previously turn in conformity with the Dharma!’ (

source: །གང་ཡང་བདག་གིས་ལམ་འཕགས་པའི་འབྱུང་བ་རྟོགས་པར་འགྱུར་བ། དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བར་བསྟན་པ་དེ་དག་ལ་ནན་ཏན་བྱས་ན། སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བར་མི་འབྱུང་ངོ་ཞེས་བྱ་བ་དེ་ལྟ་བུའི་གནས་མེད་དོ། །དེའི་ཕྱིར་བདག་ལ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། གཞན་སུ་ཡང་རུང་སྟེ། འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: 4) “ ‘When I claim to have shown the path that leads to realizing the emancipation of the noble and that will genuinely bring an end to suffering for those who make use of it, if some virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else in the world should say that even if one persists on this path, it will not lead to emancipation, that suffering will not cease, and that that is impossible, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: བག་ཚ་བ་མེད་པ་ཐོབ་པ་དང་། མི་འཇིགས་པ་ཐོབ་པར་རྣམ་པར་སྤྱད་དེ།
en: To have attained this absence of trepidation is to have attained fearlessness.
